import React, { useContext } from "react";

import { Link } from "react-router-dom";

import AnnaImage from "../img/about/AnnaImage1.png";

import { motion } from "framer-motion";

import { transition1 } from "../transitions";
import { CursorContext } from "../context/CursorContext";

const About = () => {
  const { mouseEnterHandler, mouseLeaveHandler } = useContext(CursorContext);
  return (
    <motion.section
      className="section"
      initial={{ opacity: 0, y: "100%" }}
      animate={{ opacity: 1, y: 0 }}
      exit={{ opacity: 0, y: "100%" }}
      transition={transition1}
    >
      <div
        onMouseEnter={mouseEnterHandler}
        onMouseLeave={mouseLeaveHandler}
        className="container mx-auto h-full relative"
      >
        <div className="flex flex-col lg:flex-row h-full items-center justify-center gap-x-24 text-center lg:text-left lg:pt-16">
          <div className="flex-1 max-h-96 lg:max-h-max order-2 lg:order-none overflow-hidden">
            <img src={AnnaImage} alt=" " />
          </div>
          <motion.div
            initial={{ opacity: 0, y: "-80%" }}
            animate={{ opacity: 1, y: 0 }}
            exit={{ opacity: 0, y: "-80%" }}
            transition={transition1}
            className="flex-1 pt-36 pb-14 lg:pt-0 lg:w-auto z-10 flex flex-col justify-center items-center lg:items-start"
          >
            <h1 className="h1">About me</h1>
            <p className="max-h-[45vh] max-w-lg overflow-y-auto p-5 rounded-md text-base lg:text-lg xl:text-xl mb-12">
              Я навчалася в залізничному коледжі, по професії «Управління
              пасажирськими перевезеннями та вантажоперевезеннями» &#128644;
              &#129299; <br /> Так ось, 4 курс, я вже з 17 років живу окремо,
              паралельно працюю касиром в Сільпо у нічні зміни бо треба платити
              за квартиру та взагалі собі на їжу, відразу скажу, мені було дуже
              важко в цьому житті, але з віку коли почала працювати ще важче ...
              <br />
              На носу дипломна.
              <br /> Я вже тоді розуміла що це не моє, працювати я там не буду,
              отже вирішую пройти курси на візажиста,так трохи підзаробила, мені
              це подобалось, але
              <br /> Мої рідні,моя сім'я (крім бабусі, чогось вона щось в мені
              завжди бачила), НІКОЛИ не підтримували мене, мої ідеї, мої мрії,
              починання і навіть досягнення. «ДЯКУЮ» &#128517; завдяки вам я
              досягаю своїх цілей та нікого не слухаю!
              <br /> Кінець навчання, я починаю фотографувати, беру кредит на
              техніку, «розумію що додались витрати &#128553; кидаю фотографію,
              іду заробляти майже по професії.
              <br /> Іду на курси «провідника пас. вагону», тут можна довго
              розповідати скільки я за весь час просто угробила там своє
              здоров'я, робота яка і досі відгукується мені... працювала я там
              2,5 роки, після одної операції коли у менепочались ускладнення, а
              на роботі мені кажуть «Ниче, не умрешь, у тебя рейс», я зрозуміла
              ГОДІ, і знову починаю фотографувати та працювати в Франсуа
              продавцем-баристою ,розумію що моїх сил не вистачає на все разом,
              чоловік забирає до себе на роботу Товарознавцем складської
              логістики, все би нічого, АЛЕ...
              <br /> Жіночий зміїний колектив, (дякуючи Богу хоч декілька
              нормальних людей було, завдяки кому не так падав духом),
              незадоволені обличчя 24/7 навіть якщо я дихаю, згодом це перейшло
              в зниклі документи з моєї зміни, вічні конфлікти на пустому місці,
              19 січня ми з чоловіком вирішуємо що все, це остання крапка, я
              знову закинула те чим займалася, знову нервові зриви, ми вирішуємо
              ризикнути, я хочу працювати на себе, хочу орендувати приміщення
              для студії,23 лютого я звільняюся,24...війна <br />
              Перші пару тижнів не вірилось,робота уже не йшла „люди налякані
              Потім я зрозуміла, що все життя перегорнулось з ніг на голову
              &#128553;
              <br /> Через деякий час поїхали до Одеси, і все треба було
              починати з О,але на диво, в мене були клієнти,працювало сарафанне
              радіо,я дуже вдячна цьому місту &#128524; я ще закінчила курси
              потім перукаря,попрацювала в салоні, знову ж таки закинувши фото,
              зрозуміла що не хочу більше інших професій,що ФОТОГРАФ це все ж
              таки покликання &#128525;. Згодом ми повернулися до Миколаїва, в
              той час коли людей на вулицях майже не було . <br />
              Я в паніці що робити, за що братися, де брати гроші на життя (весь
              цей час працював чоловік, за що я йому завжди дуже вдячна, єдина
              людина яка завжди мене витягувала з тих робіт,та казав займайся
              уже тим що в тебе виходить та подобається, розвивайся, навчайся, я
              допоможу, якщо ти читаєш це, люблю тебе дуже &#128524; &#129505;),
              в котре аби не його підтримка я би працювала десь адміном в
              фотостудії за 5 тис &#128517; хто знає той зрозуміє
              <br /> В цьому році, я остаточно поставила перед собою ціль, щоб
              моя мрія стала реальністю, і маленькими кроками я до неї іду! Я
              пройшла курси онлайн по фото, купила курс у фотографа
              Миколаївського,десь я зрозуміла що гроші на вітер, але ... досвід
              <br />
              Зрозуміла що я хочу навчати,не так як мене, щоб про мене не казали
              «гроші на вітер за три дні» і тд Навчання пішло, клієнти з'явилися
              в такій кількості, що не встигала обробляти фото за місяць
              &#128517; <br />
              І зараз згадую той момент, коли я боялась почати прислуховуватися
              до себе, не до людей, до свої бажань та мрій, не завжди звичайно
              були вдалі зйомки, не завжди задоволені клієнти, але це нормально,
              це життя, досвід,ми всьому навчаємось, робимо помилки,та ідемо
              далі, не треба на одній невдалій зйомці зупинятися (і я не про
              зйомку &#128521;). Я не боюсь більше конкурентів, що скажуть
              родичі, що скажуть люди, чи сподобаюсь я комусь чи ні,я не боюсь
              помилитись та зробити не так, Я у себе - на 1 місці, потім все
              інше. У мене є своя думка ! Та ніхто не має права лізти у моє
              життя та навчати як правильно, якщо не ви мені допомагали в житті,
              то і не вам давати мені поради котрих я не питаю, як правильно
              зробити. Якщо ти не будеш слухати свої бажання, ти ніколи не
              здобудеш того про що ти мрієш.
              <br /> І так, це дійсно круто коли ти ідеш по вулиці, тебе
              зупиняють так кажуть «привіііт, а я на вас підписана, кльові
              фото», чи на святі зустрічаєш своїх клієнтів а вони такі «ооо, це
              ж наш фотограф», блін, та це офігеvнно що ти крок за кроком ближче
              до мети &#128525; &#128525; &#128525; Я не щаслива тільки за те,
              що нажаль в нашій чудовій країні, рівень життя називається
              «ВИЖИТИ», без корупції нікуди, якщо б цього не було, я думаю кожен
              би зміг розвиватися, самореалізовуватися та відкривати власну
              справу, але маємо що маємо &#128533; <br />
              Чи щаслива я зараз що обрала цю професію? Так. І всім бажаю горіти
              своєю роботою, та працювати з задоволенням &#129392; &#129293;
              <br />
              <br />
            </p>
            <Link to={"/portfolio"} className="btn">
              View my work
            </Link>
          </motion.div>
        </div>
      </div>
    </motion.section>
  );
};

export default About;
